; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph2 - mode
	thermograph3 - mode
	thermograph6 - mode
	spectrograph4 - mode
	thermograph5 - mode
	spectrograph1 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star6 - direction
	GroundStation4 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph5)
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph6)
	(calibration_target instrument1 Star6)
	(supports instrument2 thermograph5)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(have_image Phenomenon8 thermograph2)
	(have_image Star9 thermograph0)
	(have_image Star9 thermograph6)
	(have_image Star10 thermograph0)
	(have_image Phenomenon11 thermograph3)
	(have_image Phenomenon11 thermograph6)
	(have_image Planet12 spectrograph1)
	(have_image Planet12 thermograph2)
	(have_image Star13 thermograph5)
	(have_image Star13 spectrograph1)
	(have_image Star14 thermograph0)
	(have_image Star14 spectrograph1)
	(have_image Star15 thermograph0)
	(have_image Star15 thermograph5)
))

)

; plan
1. (turn_to satellite0 groundstation4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 14
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 14
3. (calibrate satellite0 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 14
4. (turn_to satellite0 star15 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star15)
   goals met: 0 of 14
5. (take_image satellite0 star15 instrument2 thermograph5)
   added: (have_image star15 thermograph5)
   goals met: 1 of 14
6. (turn_to satellite0 planet12 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 planet12)
   goals met: 1 of 14
7. (take_image satellite0 planet12 instrument2 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 2 of 14
8. (turn_to satellite0 phenomenon8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 14
9. (take_image satellite0 phenomenon8 instrument2 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 3 of 14
10. (turn_to satellite0 groundstation7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation7)
   goals met: 3 of 14
11. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 3 of 14
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 14
13. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 3 of 14
14. (turn_to satellite0 planet12 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet12)
   goals met: 3 of 14
15. (take_image satellite0 planet12 instrument0 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 4 of 14
16. (turn_to satellite0 star13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star13)
   goals met: 4 of 14
17. (take_image satellite0 star13 instrument0 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 5 of 14
18. (take_image satellite0 star13 instrument0 thermograph5)
   added: (have_image star13 thermograph5)
   goals met: 6 of 14
19. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 6 of 14
20. (take_image satellite0 star14 instrument0 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 7 of 14
21. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 7 of 14
22. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 7 of 14
23. (turn_to satellite0 star6 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star6)
   goals met: 7 of 14
24. (calibrate satellite0 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 7 of 14
25. (turn_to satellite0 phenomenon11 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon11)
   goals met: 7 of 14
26. (take_image satellite0 phenomenon11 instrument1 thermograph3)
   added: (have_image phenomenon11 thermograph3)
   goals met: 8 of 14
27. (take_image satellite0 phenomenon11 instrument1 thermograph6)
   added: (have_image phenomenon11 thermograph6)
   goals met: 9 of 14
28. (turn_to satellite0 star10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star10)
   goals met: 9 of 14
29. (take_image satellite0 star10 instrument1 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 10 of 14
30. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 10 of 14
31. (take_image satellite0 star14 instrument1 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 11 of 14
32. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 11 of 14
33. (take_image satellite0 star15 instrument1 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 12 of 14
34. (turn_to satellite0 star9 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star9)
   goals met: 12 of 14
35. (take_image satellite0 star9 instrument1 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 13 of 14
36. (take_image satellite0 star9 instrument1 thermograph6)
   added: (have_image star9 thermograph6)
   goals met: 14 of 14
